Repository: AmandoP/calliope-workbook1-nl
Catalog: omegat/project_save.tmx
Source language: de_de
Languages: nl

source: Hinweis: Stelle sicher, dass du deine Calliope mini Version im Simulator siehst.
nl: Opmerking: Zorg ervoor dat je je Calliope mini-versie in de simulator ziet.

source: Hoch hinaus! Hast du es gewusst: Der Calliope mini war zusammen mit dem ESA-Astronauten Matthias Maurer auf der internationalen Raumstation und hat dort fleißig Experimente ausgeführt.
nl: Hoog in de lucht! Wist je dat: de Calliope mini was samen met ESA-astronaut Matthias Maurer op het internationale ruimtestation en heeft daar ijverig experimenten uitgevoerd.

source: Hund frisst
nl: De hond eet

source: Ich beiße ein Stück der Banane ab.
nl: Ik bijt een stukje van de banaan af.

source: Ich entferne die Schale.
nl: Ik haal de schil eraf.

source: Ich gehe zur Tür.
nl: Ik loop naar de deur.

source: Ich gucke aus dem Fenster
nl: Ik kijk uit het raam

source: Ich höre ein „Herein“.
nl: Ik hoor iemand ‘Kom binnen’ zeggen.

source: Ich kaue.
nl: Ik kauw.

source: Ich klopfe.
nl: Ik klop op de deur.

source: Ich nehme die Banane.
nl: Ik neem de banaan.

source: Ich schlucke hinunter.
nl: Ik slik.

source: Ich trete ein.
nl: Ik kom binnen.

source: Ich wiederhole drei Mal:
nl: Ik herhaal dit drie keer:

source: Ich wiederhole folgende drei Vorgänge, bis die Banane aufgegessen ist:
nl: Ik herhaal de volgende drie handelingen totdat de banaan op is:

source: Im Simulator kannst du die Programme direkt testen.
nl: In de simulator kun je de programma's direct testen.

source: Importiere die benötigten Programmblöcke:CO2-Sensor-SCD40
nl: Importeer de benodigde programmablokken:CO2-sensor-SCD40

source: In der Bibliothek findest du alle Programmblöcke, die du für deine Anweisungen benötigst.
nl: In de bibliotheek vind je alle programmablokken die je nodig hebt voor je instructies.

source: In der Kategorie Eingabe findest du den Ereignisblock „gedrückt“.
nl: In de categorie Invoer vind je het gebeurtenisblok „ingedrukt”.

source: In dieser Variable wird der über Funk empfangene Text gespeichert.
nl: In deze variabele wordt de via de radio ontvangen tekst opgeslagen.

source: In vielen Abläufen kannst du wiederkehrende Muster erkennen.Manche Wiederholungen haben eine definierte Anzahl.
nl: In veel processen kun je terugkerende patronen herkennen.Sommige herhalingen hebben een vast aantal.

source: Inhaltsverzeichnis
nl: Inhoudsopgave

source: JETZT
nl: NU

source: Je genauer die Anweisungen, desto präziser ist das Ergebnis.
nl: Hoe gedetailleerder de instructies, hoe nauwkeuriger het resultaat.

source: KENNENLERNEN
nl: KENNISMAKEN

source: Kennenlernen
nl: Kennismaken

source: Kennst du die verschiedenen Bereiche des Editors und kannst sie den Beschreibungen zuordnen?
nl: Ken je de verschillende onderdelen van de editor en kun je ze aan de beschrijvingen koppelen?

source: Klavier
nl: Piano

source: Klicke dazu auf die drei Punkte neben „Herunterladen“ und drücke „Hardware auswählen“.
nl: Klik hiervoor op de drie puntjes naast ‘Downloaden’ en selecteer ‘Hardware selecteren’.

source: Knöpfe
nl: Knopen

source: LED-Matrix18RGB-LED21Knöpfe24Lautsprecher25Touch-Pins26Funken28
nl: LED-matrix18RGB-LED21Knoppen24Luidspreker25Touch-pinnen26Vonken28

source: LOS
nl: GAAN

source: LUFTQUALITÄT
nl: LUCHTKWALITEIT

source: Lagesensor
nl: Positiesensor

source: Lasse die RGB-LED grün leuchten,wenn Pin 0 gedrückt wird.
nl: Laat de RGB-LED groen branden,wanneer pin 0 wordt ingedrukt.

source: Lasse die Tonleiter abspielen.C - D - E - F - G - A - H - C
nl: Speel de toonladder af.C - D - E - F - G - A - H - C

source: Lasse eine Melodie abspielen,wenn Knopf A gedrückt wird.
nl: Speel een melodie afwanneer knop A wordt ingedrukt.

source: Lasse einen Smiley erscheinen, wenn der Knopf A gedrückt wird und einen traurigen Smiley, wenn der Knopf B gedrückt wird.
nl: Laat een smiley verschijnen als er op knop A wordt gedrukt en een verdrietige smiley als er op knop B wordt gedrukt.

source: Lautsprecher
nl: Luidspreker

source: Lerne den Calliope mini kennen.Entwickle kreative Ideen und produziere eigene Prototypen.
nl: Maak kennis met de Calliope mini.Ontwikkel creatieve ideeën en maak je eigen prototypes.

source: Lerne die einzelnen Aktoren und Sensoren des Calliope mini zu steuern und erstelle erste eigene Programme.
nl: Leer de afzonderlijke actuatoren en sensoren van de Calliope mini aan te sturen en maak je eerste eigen programma’s.

source: Licht32Lautstärke34Temperatur37Lage40Orakel42Feuchtigkeitssensor44Pflanzenstation45Ultraschallsensor48Personenzähler50CO2-Sensor53Luftqualität54
nl: Licht32Volume34Temperatuur37Positie40Orakel42Vochtigheidssensor44Plantstation45Ultrasone sensor48Personenteller50CO2-sensor53Luchtkwaliteit54

source: Lizenziert unter Creative Commons Namensnennung 4.0 InternationalCalliope gGmbH
nl: Gelicentieerd onder Creative Commons Naamsvermelding 4.0 InternationaalCalliope gGmbH

source: Luftqualität
nl: Luchtkwaliteit

source: Mache einen Plan!
nl: Maak een plan!

source: Mache einen Plan.2) Setze dein Programm aus den einzelnen Programmblöcken zusammen.3) Überprüfe dein Programm im Simulator.4) Übertrage dein Programm auf den Calliope mini.5) Führe dein Programm auf dem Calliope mini aus.
nl: Maak een plan.2) Stel je programma samen uit de afzonderlijke programmablokken.3) Controleer je programma in de simulator.4) Zet je programma over naar de Calliope mini.5) Voer je programma uit op de Calliope mini.

source: Macht der Hund„Sitz“?
nl: Kan de hond„Zit“ doen?

source: Material
nl: Materiaal

source: Mikrofon
nl: Microfoon

source: Minus-Pinnicht vergessen!
nl: Vergeet de min-pinniet!

source: Mischt man alle drei Farben auf einmal, ergibt das weiß.
nl: Als je alle drie de kleuren tegelijk mengt, krijg je wit.

source: Mit Hilfe der Sensoren kann der Calliope mini unterschiedlichste Werte aus der Umgebung messen.
nl: Met behulp van de sensoren kan de Calliope mini allerlei verschillende waarden uit de omgeving meten.

source: Mit demGrove-Kabel wird der SCD40 über den Grove-Anschluss A0 mit dem Calliope mini verbunden.
nl: Met deGrove-kabel wordt de SCD40 via de Grove-aansluiting A0 aangesloten op de Calliope mini.

source: Mit der CO2-Platine lassen sich drei unterschiedliche Werte messen.
nl: Met de CO2-printplaat kunnen drie verschillende waarden worden gemeten.

source: Mit der Maus ...
nl: Met de muis ...

source: NEIN
nl: NEE

source: Napfbereitstellen
nl: Napfklaarzetten

source: Nur Calliope mini der gleichen Funkgruppe können untereinander kommunizieren.Die Programmblöcke, die hierfür benötigt werden, müssen in die Bibliothek hinzugefügt werden.
nl: Alleen Calliope mini’s uit dezelfde radiogroep kunnen onderling communiceren.De programmablokken die hiervoor nodig zijn, moeten aan de bibliotheek worden toegevoegd.

source: Nur durch Testen und Ausprobieren erfährst du, welche Geschwindigkeit die richtige für dich ist.Programmiererinnen und Programmierer sind sehr gerne bequem.
nl: Alleen door te testen en uit te proberen kom je erachter welke snelheid voor jou de juiste is.Programmeurs houden erg van gemak.

source: Nur durch Testen und Ausprobieren, erfährst du welche Geschwindigkeit die richtige für dich ist.Programmier:innen sind sehr gerne bequem.Anstatt immer wieder in jedem Pause Befehl die Geschwindigkeit zu ändern, kannst dues dir viel einfacher machen.
nl: Alleen door te testen en uit te proberen kom je erachter welke snelheid voor jou de juiste is.Programmeurs houden erg van gemak.In plaats van de snelheid bij elke pauzecommando steeds opnieuw aan te passen, kun jehet jezelf veel gemakkelijker maken.

source: Nutze dafür den Platz auf der nächsten Seite.
nl: Gebruik daarvoor de ruimte op de volgende pagina.

source: Oder scanne denQR-Code.
nl: Of scan deQR-code.

source: Optimiere dein Programm, indem du Wiederholungen erkennst und Wiederholungsschleifen verwendest, anstatt den gleichen Befehl mehrmals hintereinander abzubilden.
nl: Optimaliseer je programma door herhalingen te herkennen en herhalingslussen te gebruiken, in plaats van hetzelfde commando meerdere keren achter elkaar uit te voeren.

source: Ordne die Bauteile des Calliope mini den unterschiedlichen Kategorien Eingabe, Verarbeitung und Ausgabe zu, indem du sie mit Linien verbindest.
nl: Deel de onderdelen van de Calliope mini in de verschillende categorieën Invoer, Verwerking en Uitvoer in door ze met lijnen te verbinden.

source: Ordne die Begriffe zu und schreibe sie an die Linien.Computer, Monitor, Tastatur, Maus, Lautsprecher
nl: Breng de begrippen in de juiste volgorde en schrijf ze op de lijnen.Computer, monitor, toetsenbord, muis, luidspreker

source: Ordne die einzelnen Teile den Kategorien Eingabe (pink), Verarbeitung (grün) oder Ausgabe (türkis) zu, indem du sie mit der passenden Farbe einkreist.
nl: Deel de afzonderlijke onderdelen in de categorieën Invoer (roze), Verwerking (groen) of Uitvoer (turkoois), door ze met de juiste kleur te omcirkelen.

source: Ort
nl: Plaats

source: Programme übertragen
nl: Programma's overzetten

source: Programmiere anhand deinesStruktogramms.Hinweis: Benutze die Wiederholungsschleife aus der Kategorie „Schleifen“.
nl: Programmeer aan de hand van jestructogram.Opmerking: Gebruik de herhalingslus uit de categorie „Lussen“.

source: Programmiere anhand des Struktogramms.Hinweis: Vergiss die Pausen nicht!
nl: Programmeer aan de hand van het structogram.Opmerking: Vergeet de pauzes niet!

source: Programmieren heißt, einem Computer (z.B. deinem Calliope mini) Schritt-für-Schritt zu sagen, was er tun soll.
nl: Programmeren betekent dat je een computer (bijvoorbeeld je Calliope mini) stap voor stap vertelt wat hij moet doen.

source: Programmierumgebung
nl: Programmeeromgeving

source: Projekt benennenGib einen passenden Namen ein und klicke auf „Erstelle“.
nl: Geef het project een naamVoer een passende naam in en klik op ‘Aanmaken’.

source: Prozessor
nl: Processor

source: Raketenstart
nl: Raketlancering

source: Relative Humidityrelative Luftfeuchtigkeit
nl: Relative Humidityrelatieve luchtvochtigheid

source: Saft in ein Glas gießen
nl: Sap in een glas gieten

source: Schau dir den Programmcode an und beobachte im Simulator, was passiert.
nl: Bekijk de programmacode en kijk in de simulator wat er gebeurt.

source: Schau dir den Programmcode an und beschreibe was passiert, wenn der Wert der Variable „Tempo“ von 1000 auf 500 geändert wird.
nl: Bekijk de programmacode en beschrijf wat er gebeurt als de waarde van de variabele „Tempo“ wordt gewijzigd van 1000 naar 500.

source: Schau dir den Programmcode an und beschreibe was passiert, wenn der Wert der Variablen „Tempo“ von 1000 auf 500 geändert wird.
nl: Bekijk de programmacode en beschrijf wat er gebeurt als de waarde van de variabele „Tempo“ wordt gewijzigd van 1000 naar 500.

source: Schau dir den Programmcode an und beschreibe, was passiert.
nl: Bekijk de programmacode en beschrijf wat er gebeurt.

source: Schau dir den Programmcode an und ordne folgende Abläufe den einzelnen Programmblöcken zu:
nl: Bekijk de programmacode en wijs de volgende processen toe aan de afzonderlijke programmablokken:

source: Schau dir den Programmcode genau an.
nl: Bekijk de programmacode eens goed.

source: Schau dir die einzelnen Schritte zum Übertragen deines Programms auf den Calliope mini genau an und bringe sie in die richtige Reihenfolge.
nl: Bekijk de afzonderlijke stappen voor het overzetten van je programma naar de Calliope mini goed en zet ze in de juiste volgorde.

source: Schau mal, was dir einfällt.
nl: Kijk maar eens wat je kunt bedenken.

source: Schleifen
nl: Slijpen

source: Schließe die Platine an.
nl: Sluit de printplaat aan.

source: Schreibe ein Programm für„Alle Vögel sind schon da“.Hinweis: Achte auf die Tonlängen und optimiere dein Programm durch Wiederholungen.
nl: Schrijf een programma voor„Alle vogels zijn er al“.Opmerking: Let op de toonlengtes en optimaliseer je programma door middel van herhalingen.

source: Schreibe sie auf.
nl: Schrijf ze op.

source: Sende eine Textnachricht deiner Wahl an dein Team.
nl: Stuur een sms naar keuze naar je team.

source: Sende „Alles Gute” an dein Team und lasse nach dem Empfangen der Nachricht ein Herz auf der LED-Matrix erscheinen.
nl: Stuur ‘Het allerbeste’ naar je team en laat na ontvangst van het bericht een hartje op de LED-matrix verschijnen.

source: Sensoren sind wie Sinne.
nl: Sensoren zijn net als zintuigen.

source: Sie sind in bunte Kategorien eingeordnet.
nl: Ze zijn ingedeeld in kleurrijke categorieën.

source: Sinne
nl: Zinnen

source: So können auch andere deinen Plan lesen und mitdenken.
nl: Zo kunnen ook anderen je plan lezen en meedenken.

source: So verhinderst du, dass Programme nicht funktionieren und du nicht genau sagen kannst, woran es liegt.
nl: Zo voorkom je dat programma’s niet werken en je niet precies kunt zeggen wat de oorzaak is.

source: Spiele Noten mit dem Calliope mini!
nl: Speel muziek met de Calliope mini!

source: Starte dein Programm mit einer Note auf der LED-Matrix.Gehe Schritt für Schritt vor:a) Erstelle ein Struktogramm für den Programmcode.b) Programmiere anhand des Struktogramms.c) Teste dein Programm im Simulator.d) Übertrage den Code auf den Calliope mini.e) Probiere das Klavier aus.Erfinde ein Klavier, das über leitende Materialien gespielt werden kann.
nl: Start je programma met een noot op de LED-matrix.Ga stap voor stap te werk:a) Maak een structogram voor de programmacode.b) Programmeer aan de hand van het structogram.c) Test je programma in de simulator.d) Zet de code over naar de Calliope mini.e) Probeer de piano uit.Bedenk een piano die bespeeld kan worden via geleidende materialen.

source: Starte mit einem neuen Projekt und schau dir die Oberfläche genau an.
nl: Begin met een nieuw project en bekijk de interface eens goed.

source: Stelle eine Vermutung auf, ob deine Materialien Strom leiten und fülle die Tabelle aus.
nl: Probeer te raden of je materialen elektriciteit geleiden en vul de tabel in.

source: StruktogrammE
nl: Structogram E

source: Struktogramme
nl: Structogrammen

source: Taste A
nl: Toets A

source: Taste B
nl: Toets B

source: Tasten
nl: Toetsen

source: Teste im Editor und beschreibe.
nl: Test het in de editor en beschrijf het.

source: Teste sie im Editor und notiere die Eigenschaften.
nl: Test ze in de editor en noteer de eigenschappen.

source: Testen im Simulator
nl: Testen in de simulator

source: Testen im Simulator!
nl: Testen in de simulator!

source: Tipp: Die Version deines Calliope mini erkennst du am Aufdruck auf der Rückseite.
nl: Tip: Je kunt de versie van je Calliope mini herkennen aan de opdruk op de achterkant.

source: Tipp: Teile dein Programm bereits in der Planung in kleine Schritte auf.
nl: Tip: Verdeel je programma al tijdens de planning in kleine stappen.

source: Tipp: Es ist wichtig, gleichzeitig den Minus (-) Pin zu berühren, um eine Pin-Eingabe auszulösen.
nl: Tip: Het is belangrijk om tegelijkertijd de min-pin (-) aan te raken om een pin-invoer te activeren.

source: Tipp: Die Farben der Blöcke geben dir einen Hinweis in welcher Kategorie du sie findest.
nl: Tip: De kleuren van de blokken geven je een indicatie in welke categorie je ze kunt vinden.

source: Tipp: Die Farben der Blöcke geben dir einen Hinweis, in welcher Kategorie du sie findest.
nl: Tip: De kleuren van de blokken geven je een indicatie in welke categorie je ze kunt vinden.

source: Touch-Pins
nl: Touch-pinnen

source: Um genauere Werte zu bekommen, schreibe ein Programm, das den gemessenen Lichtwert bei ausgeschalteter LED-Matrix in eine Variable speichert und lasse dir den gespeicherten Wert danach auf der LED-Matrix anzeigen.
nl: Om nauwkeurigere waarden te krijgen, schrijf je een programma dat de gemeten lichtwaarde opslaat in een variabele terwijl de LED-matrix is uitgeschakeld, en laat je de opgeslagen waarde daarna op de LED-matrix weergeven.

source: Verarbeitung
nl: Verwerking

source: Verbinde deinen Calliope mini mit dem USB-Kabel mit deinem Computer.
nl: Sluit je Calliope mini met de USB-kabel aan op je computer.

source: Verbinde die Bezeichnungen mit den einzelnen Bauteilen.
nl: Koppel de benamingen aan de afzonderlijke onderdelen.

source: Vergiss nicht “Knopf A” und “Knopf B” zu drücken.
nl: Vergeet niet op “knop A” en “knop B” te drukken.

source: Vergiss nicht, Knopf A und Knopf B zu drücken.
nl: Vergeet niet op knop A en knop B te drukken.

source: Vermutung
nl: vermoeden

source: Vervollständige das Struktogramm:
nl: Maak het structogram compleet:

source: Verwende die CO2-Platine um die Luftqualität zu messen.
nl: Gebruik de CO2-printplaat om de luchtkwaliteit te meten.

source: Vorherige Versionen haben eine RGB-LED.
nl: Eerdere versies hebben een RGB-led.

source: Warum wird dir niemals ein trauriger Smiley angezeigt?
nl: Waarom krijg je nooit een verdrietige smiley te zien?

source: Was funktioniert noch nicht so gut?
nl: Wat werkt nog niet zo goed?

source: Was funktioniert nocht nicht so gut?
nl: Wat werkt nog niet zo goed?

source: Was funktioniert schon ziemlich gut?
nl: Wat werkt al redelijk goed?

source: Was ist Programmieren?
nl: Wat is programmeren?

source: Was ist Programmieren?4Der Calliope mini8Struktogramme10Programmierumgebung12Programme übertragen16Den Calliope mini steuern17
nl: Wat is programmeren?4De Calliope mini8Structogrammen10Programmeeromgeving12Programma's overzetten16De Calliope mini bedienen17

source: Weitere Informationen58
nl: Meer informatie58

source: Welche Funktionen haben die einzelnen Schaltflächen?
nl: Welke functies hebben de afzonderlijke knoppen?

source: Welche Funktionen haben die einzelnen Teile?
nl: Welke functies hebben de afzonderlijke onderdelen?

source: Welche Teile kennst du?
nl: Welke onderdelen ken je?

source: Welche Vorgänge fallen dir noch ein, bei denen sich bestimmte Handlungen wiederholen?
nl: Welke situaties kun je nog meer bedenken waarin bepaalde handelingen zich herhalen?

source: Wenn du eine Idee hast, mache einen Plan.
nl: Als je een idee hebt, maak dan een plan.

source: Wenn du genau hinsiehst, kannst du verschiedene Symbole erkennen, die dir Hinweise zu Bauteilen geben.
nl: Als je goed kijkt, zie je verschillende symbolen die je aanwijzingen geven over de onderdelen.

source: Wenn ich Geburtstag habe,
nl: Als ik jarig ben,

source: Wenn ich glücklich bin,
nl: Als ik gelukkig ben,

source: Wenn ich krank bin,
nl: Als ik ziek ben,

source: Werden sie gedrückt, senden sie ein Signal an den Calliope mini, um eine vorab programmierte Anweisung auszuführen.
nl: Als je erop drukt, sturen ze een signaal naar de Calliope mini om een vooraf geprogrammeerde opdracht uit te voeren.

source: Wert 1
nl: Waarde 1

source: Wert 2
nl: Waarde 2

source: Wichtig: „receivedString“ ist eine vorab definierte Variable.
nl: Belangrijk: „receivedString“ is een vooraf gedefinieerde variabele.

source: Wichtige Blöcke:
nl: Belangrijke onderdelen:

source: Wie das funktioniert, findest du auf dieser Seite heraus.
nl: Op deze pagina kom je te weten hoe dat werkt.

source: Wie kann ich Programme speichern?
nl: Hoe kan ik programma's opslaan?

source: Wie kann ich ein Programm öffnen?
nl: Hoe kan ik een programma openen?

source: Wie sieht deine Rakete aus oder ein Gespenst?
nl: Hoe ziet jouw raket eruit, of is het een spook?

source: Wie sieht deine Rakete aus?
nl: Hoe ziet jouw raket eruit?

source: Wiederhole diese Testschleifen immer wieder.
nl: Herhaal deze testlussen steeds opnieuw.

source: Wiederholung/Schleife
nl: Herhaling/lus

source: Woran hast du länger getüftelt?
nl: Waar heb je het langst aan zitten sleutelen?

source: Wähle als Speicherort„MINI“ aus.
nl: Kies als opslaglocatie„MINI“.

source: Ziehe nun die Datei auf das Laufwerk „MINI“ - fertig!
nl: Sleep het bestand nu naar het station „MINI“ – klaar!

source: a) Erstelle eine Variable und benenne sie „Tempo“.
nl: a) Maak een variabele aan en noem deze „Tempo“.

source: a) Füge hinter jeder Zahl eine Pause ein.b) Verlängere die Pausen, indem du den Wert der Millisekunden (ms) erhöhst.c) Speichere dein Programm unter dem Namen „Raketenstart“.
nl: a) Voeg achter elk getal een pauze in.b) Verleng de pauzes door de waarde in milliseconden (ms) te verhogen.c) Sla je programma op onder de naam „Raketlancering“.

source: a) Lasse die RGB-LED pink leuchten,wenn Pin 1 gedrückt wird.b) Lasse die RGB-LED gelb leuchten,wenn Pin 2 gedrückt wird.c) Lasse die RGB-LED türkis leuchten, wenn Pin 3 gedrückt wird.
nl: a) Laat de RGB-LED roze branden,wanneer pin 1 wordt ingedrukt.b) Laat de RGB-LED geel branden,wanneer pin 2 wordt ingedrukt.c) Laat de RGB-LED turkoois branden, wanneer pin 3 wordt ingedrukt.

source: a) Wenn Taste B gedrückt, sende eine „2“.b) Wenn eine „2“ empfangen wird, zeige einen traurigen Smiley.c) Erweitere den lachenden Smiley mit einem grünem Licht und den traurigen Smiley mit einem roten Licht.
nl: a) Als toets B wordt ingedrukt, stuur dan een „2“.b) Als een „2“ wordt ontvangen, toon dan een droevige smiley.c) Voeg aan de lachende smiley een groen lampje toe en aan de droevige smiley een rood lampje.

source: b) Setze die Variable „Tempo“ vor deinem Countdown auf den Wert 100.c) Ersetze die Werte in den Pause Befehlen durch den Variablen Block „Tempo“.d) Setze den Wert der Variable „Tempo“ auf 500.
nl: b) Stel de variabele „Tempo“ vóór je aftelling in op de waarde 100.c) Vervang de waarden in de pauzecommando’s door het variabele blok „Tempo“.d) Stel de waarde van de variabele „Tempo“ in op 500.

source: bleibe ich zu Hause.
nl: dan blijf ik thuis.

source: geht‘s
nl: daar gaan we

source: lade ich Freunde ein.
nl: nodig ik vrienden uit.

source: mache ich laut Musik.
nl: zet ik de muziek hard aan.

source: sind wie
nl: zijn net als

source: symbole und muster
nl: symbolen en patronen

source: Öffne dein Programm „Raketenstart“ und führe folgende Schritte aus:
nl: Open je programma „Raketenstart“ en voer de volgende stappen uit:

source: Über „Importieren“ kannst du gespeicherte Projekte öffnen.
nl: Via „Importeren“ kun je opgeslagen projecten openen.

source: Über Funk lassen sich nicht nur Textnachrichten versenden, sondern auch Zahlen.Die Zahlen kannst du empfangen und auswerten.
nl: Via de radio kun je niet alleen tekstberichten versturen, maar ook getallen.Je kunt die getallen ontvangen en verwerken.

source: Über das Teilen-Symbol wird eine URL und ein QR-Code für dein Programm generiert.
nl: Via het deel-pictogram worden een URL en een QR-code voor je programma gegenereerd.

source: Überlege in welcher Reihenfolge einzelne Schritte ablaufen sollen.
nl: Bedenk in welke volgorde de afzonderlijke stappen moeten plaatsvinden.

source: Überprüfe die einzelnen Schritte jeweils im Simulator, verbessere dein Programm und teste es erneut auf dem Calliope mini.
nl: Controleer de afzonderlijke stappen telkens in de simulator, verbeter je programma en test het opnieuw op de Calliope mini.

source: Übersicht
nl: Overzicht

source: Übertrage dafür den Programmcode aus Aufgabe 4 in MakeCode und ergänze dein Programm um folgende Befehle:
nl: Kopieer hiervoor de programmacode uit opdracht 4 naar MakeCode en voeg de volgende commando's toe aan je programma:

source: Übertrage dein Programm auf den Calliope mini und probiere es aus.
nl: Zet je programma over naar de Calliope mini en probeer het eens uit.

source: Übungen
nl: Oefeningen

source: • Wenn Knopf A geklickt• Wenn Knopf B geklickt• Gemessene Lichtstärke inVariable „Licht“ speichern• Wert der Variable „Licht“ anzeigen
nl: • Als er op knop A wordt geklikt• Als er op knop B wordt geklikt• De gemeten lichtsterkte opslaan in de variabele „Licht“• De waarde van de variabele „Licht“ weergeven
